Repository: Olesea05/PortfolioSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro, ru

source: Olesea Ghincu
ru: Олеся Гынку

source: Skills
ro: Competențe
ru: Навыки

source: Basics of Flask
ro: Bazele Flask
ru: Основы Flask

source: Basics of HTML/CSS
ro: Bazele HTML/CSS
ru: Основы HTML/CSS

source: Hello! My name is Olesea, I am 20 years old, and I have been learning Python since 2022. I live in Moldova and speak Russian, Romanian, English (B2+) and Bulgarian. I strive to continue developing as a Python developer!
ro: Buna ziua! Mă numesc Olesea, am 20 de ani și învăț Python din 2022. Locuiesc în Moldova și vorbesc rusă, română, engleză (B2+) și bulgară. Îmi doresc să continui să mă dezvolt ca programatoare Python!
ru: Добрый день! Меня зовут Олеся, мне 20 лет, и я изучаю Python начиная с 2022 года. Я живу в Молдове и владею русским, румынским, английским (B2+) и болгарским языком. Стремлюсь продолжать развиваться как Python-разработчик!

source: Completed Courses
ro: Cursuri finalizate
ru: Оконченные курсы

source: Contests
ro: Concursuri
ru: Конкурсы

source: Completed Courses:
ro: Cursuri finalizate:
ru: Пройденные курсы:

source: Course Duration:
ro: Durata cursului:
ru: Длительность курса

source: 1 year
ro: 1 an
ru: 1 год

source: Course Outcomes:
ro: Rezultatele cursului:
ru: Итоги курса

source: Learned the profession of Python developer and basic tools.
ro: Am învățat profesia de programator Python și instrumentele de bază.
ru: Ознакомилась с профессией Python-разработчика и базовыми инструментами.

source: Implemented a learning project: Telegram bot «Quote of the Day» (Python).
ro: Am realizat un proiect de învățare: Telegram bot «Quote of the Day» (Python).
ru: Реализовала учебный проект: Telegram-бот «Quote of the Day» (Python).

source: Started development of an online store project on Django.
ro: Am început dezvoltarea unui proiect de magazin online pe Django.
ru: Начала разработку проекта интернет-магазина на Django.

source: Summer 2022 - "Python-Junior Summer School"
ro: Vara 2022 - "Școala de vară Python-Junior"
ru: Лето 2022 года - "Летняя школа Python-Junior"

source: 2 months
ro: 2 luni
ru: 2 месяца

source: Learned the basics of Django.
ro: Am învățat bazele Django.
ru: Изучила основы Django

source: Participated in the implementation and presentation of a team project "Website for City Agronomists".
ro: Am participat la realizarea și prezentarea unui proiect de echipă "Website pentru agronomi din oraș".
ru: Учавствовала в реализации и презентации командного проекта "Сайт для агрономов города".

source: Spring 2022 - "Python for Beginners"
ro: Primăvara 2022 - "Python pentru începători"
ru: Весна 2022 года - "Python для начинающих"

source: 3 months
ro: 3 luni
ru: 3 месяца

source: Learned the basics of Python.
ro: Am învățat bazele Python.
ru: Изучила основы Python

source: Implemented and presented a learning project «Budget Control» in Python using file operations in VS Code.
ro: Am realizat și prezentat un proiect de învățare «Controlul bugetului» în Python folosind operațiuni cu fișiere în VS Code.
ru: Реализовала и презентовала учебный проект «Контроль бюджета» на Python с использованием работы с файлами в VS Code

source: Close
ro: Închide
ru: Закрыть

source: Participation in Contests:
ro: Participare la concursuri:
ru: Участие в конкурсах

source: District Informatics Olympiads:
ro: Olimpiade de informatică raionale:
ru: Районные олимпиады по информатике:

source: 1st place (12th grade)
ro: Locul 1 (clasa a XII-a)
ru: I место (12 класс)

source: 1st place (11th grade)
ro: Locul 1 (clasa a XI-a)
ru: I место (11 класс)

source: 1st place (10th grade)
ro: Locul 1 (clasa a X-a)
ru: I место (10 класс)

source: Project Examples
ro: Exemple de proiecte
ru: Примеры работ

source: This website was created by me independently.
ro: Acest site a fost creat de mine în mod independent.
ru: Данный сайт разработан мной самостоятельно

source: Telegram bot "Quote of the Day", sending daily quotes
ro: Telegram bot «Quote of the Day», trimite citate zilnic
ru: Telegram bot "Quote of the Day", ежендевно высылающий цитаты

source: Online store, currently under development
ro: Magazin online, în prezent în dezvoltare
ru: Интернет-магазин, находящийся в разработке
